
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do read.do 

. clear all

. import delimited "../../raw/geonames/US.txt", varnames(nonames) delimiters(ta
> b)
(12 vars, 41,469 obs)

. 
. rename v2 zip

. rename v10 latitude

. rename v11 longitude

. 
. duplicates drop zip, force

Duplicates in terms of zip

(2 observations deleted)

. /* drop coordinates outside continental USA bounding box
> drop if latitude<24.9493
> drop if latitude>49.5904
> drop if longitude<-125.0011
> drop if longitude>-66.9326
> */
. 
. keep zip lat lon

. save "us-zip-codes.dta", replace
file us-zip-codes.dta saved

. 
end of do-file
