
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do industry-employment.do 

. clear all

. import delimited "../../derived/crosswalk/ces2industry.csv", varnames(1) clea
> r case(preserve)
(4 vars, 100 obs)

. tempfile ces

. save `ces', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05594.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05594.000001 saved

. 
. import excel "../../raw/bls/industry-employment/industry.xlsx", cellrange(A7:
> D258) sheet("Table 2.7") firstrow clear

. 
. rename Nonagriculturewageandsalary CES_label

. rename NA CES_industry

. drop C

. rename D employment

. 
. foreach X of var CES* {
  2.         replace `X' = strtrim(`X')
  3.         drop if missing(`X')
  4. }
(251 real changes made)
(1 observation deleted)
(248 real changes made)
(0 observations deleted)

. * Postal Service appears twice
. duplicates drop CES_label CES_industry, force

Duplicates in terms of CES_label CES_industry

(1 observation deleted)

. 
. destring employment, force replace
employment: all characters numeric; replaced as double

. 
. merge 1:1 CES_label CES_industry using `ces', nogen keep(match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                98  
    -----------------------------------------

. 
. 
. collapse (sum) employment, by(industry_code)

. summarize employment, detail

                      (sum) employment
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%         14.9              0
10%         64.8              0       Obs                  81
25%        307.8              0       Sum of Wgt.          81

50%        725.4                      Mean           1865.911
                        Largest       Std. Dev.      3110.532
75%       1717.5           8890
90%       5145.1         9300.1       Variance        9675411
95%       7619.9        11926.3       Skewness       3.291464
99%        19653          19653       Kurtosis       16.15582

. display r(sum)
151138.8

. 
. save "industry-employment.dta", replace
file industry-employment.dta saved

. 
end of do-file
