
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do industry-employment.do 

. clear all

. import delimited "../../derived/crosswalk/ces2industry.csv", varnames(1) clea
> r case(preserve)
(3 vars, 89 obs)

. tempfile ces

. save `ces', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St30436.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St30436.000001 saved

. 
. import delimited "../../raw/bls/industry-employment/ces-2020-feb.csv", varnam
> es(1) clear case(preserve)
(2 vars, 176 obs)

. merge 1:1 ces_industry using `ces', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                89  
    -----------------------------------------

. 
. collapse (sum) employment, by(industry_code)

. summarize employment, detail

                      (sum) employment
-------------------------------------------------------------
      Percentiles      Smallest
 1%         23.8           23.8
 5%         65.1           36.6
10%        114.8           50.4       Obs                  88
25%        407.8           54.5       Sum of Wgt.          88

50%       836.75                      Mean           1733.467
                        Largest       Std. Dev.      2309.324
75%      2137.95         8056.4
90%       4250.4           8937       Variance        5332979
95%       7855.3         9717.3       Skewness       2.493589
99%      12287.5        12287.5       Kurtosis       9.504224

. display r(sum)
152545.1

. 
. save "industry-employment.dta", replace
file industry-employment.dta saved

. 
end of do-file
