
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do filter.do 

. clear all 

. import delimited "ces.txt", delimiters(tab)
(5 vars, 7,671,102 obs)

. 
. keep if year==2020 & period=="M02"
(7,669,140 observations deleted)

. keep if regexm(series_id, "CES........01")
(1,786 observations deleted)

. generate str ces_industry = substr(series_id, 4, 8)

. keep ces_industry value

. rename value employment

. order ces_industry employment

. 
. export delimited "ces-2020-feb.csv", replace
(note: file ces-2020-feb.csv not found)
file ces-2020-feb.csv saved

. 
end of do-file
