
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do employment-matrix.do 

. * crosswalk
. clear all 

. import delimited "../../derived/crosswalk/naics2industry.csv", varnames(1) cl
> ear
(3 vars, 87 obs)

. tempfile naics

. save `naics', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St30451.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St30451.000001 saved

. 
. clear all

. import excel "../../raw/bls/employment-matrix/matrix.xlsx", cellrange(A1:G110
> 576) sheet("Matrix") firstrow

. 
. * drop all summaries
. keep if Occupationtype=="Line item" & Industrytype=="Line item"
(76,853 observations deleted)

. drop if Industrycode=="TE1100"
(591 observations deleted)

. 
. clonevar naics_6d = Industrycode

. replace naics_6d = subinstr(naics_6d, "A", "0",.)
(2,388 real changes made)

. replace naics_6d = subinstr(naics_6d, "A", "0",.)
(0 real changes made)

. replace  naics_6d = subinstr(naics_6d, "-", "0",.)
(9 real changes made)

. destring naics_6d, force replace
naics_6d: all characters numeric; replaced as long

. 
. generate naics_3d = int(naics_6d/1000)

. rename Occupationcode SOCCode

. 
. * aggregate by our sector definitions
. merge m:1 naics_3d using `naics', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            31,476  
    -----------------------------------------

. collapse (sum) Employment, by(industry_code SOCCode)

. 
. keep SOCCode industry_code Employment

. save "matrix.dta", replace
file matrix.dta saved

. 
end of do-file
