
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do compute_urban_share.do 

. clear all

. use "../../clean/cbp/zip_code_business_patterns.dta"

. 
. local density_cutoff 1000

. generate byte high_density = (population_density>`density_cutoff' & !missing(
> population_density)) | (employment_density>`density_cutoff' & !missing(employ
> ment_density))

. 
. generate high_density_employment = high_density * employment

. 
. collapse (sum) employment large_plant_employment high_density_employment, by(
> naics)

. foreach X of var *_employment {
  2.         replace `X' = int(`X' / employment * 100)
  3. }
(76 real changes made, 1 to missing)
(86 real changes made, 1 to missing)

. drop employment

. compress
  variable large_plant_employment was double now byte
  variable high_density_employment was double now byte
  (1,204 bytes saved)

. 
. label variable large_plant_employment "Share of workers in plants larger than
>  99 (percent)"

. label variable high_density_employment "Share of workers in ZIP codes above `
> density_cutoff' person/km2 density (percent)"

. 
. export delimited "high_density_employment.csv", replace
file high_density_employment.csv saved

. save "high_density_employment.dta", replace
file high_density_employment.dta saved

. 
end of do-file
