
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do compute_urban_share.do 

. clear all

. use "../../clean/cbp/zip_code_business_patterns.dta"

. 
. generate average_density = ln(population_density) * employment
(6,099 missing values generated)

. replace employment = 0 if missing(ln(population_density))
(6,099 real changes made)

. 
. collapse (sum) employment average_density, by(industry_code)

. replace average_density = exp(average_density/employment)
(69 real changes made)

. rename employment cbp_employment

. compress
  variable cbp_employment was double now long
  (276 bytes saved)

. 
. label variable average_density "Average population density (person/km2)"

. 
. export delimited "high_density_employment.csv", replace
file high_density_employment.csv saved

. save "high_density_employment.dta", replace
file high_density_employment.dta saved

. 
end of do-file
