
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do counterfactual.do 

. clear all

. 
. import delimited "../data/derived/crosswalk/industry.csv", varnames(1) clear 
> case(preserve)
(3 vars, 90 obs)

. merge 1:1 industry_code using "../data/clean/industry-employment/industry-emp
> loyment.dta", nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                                88  
    -----------------------------------------

. rename employment ces_employment

. tempfile industry

. save `industry', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St38473.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St38473.000001 saved

. 
. import delimited "../data/derived/crosswalk/2digit_names.csv", varnames(1) cl
> ear case(preserve)
(2 vars, 20 obs)

. tempfile digit2

. save `digit2', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St38473.000002 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St38473.000002 saved

. 
. do "industry_location_panel.do"

. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(6 vars, 84 obs)

. tempfile occupation

. save `occupation', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St38473.000003 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St38473.000003 saved

. 
. use "../data/clean/cbp/zip_code_business_patterns.dta", clear

. merge m:1 industry_code using `occupation', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           464,804  
    -----------------------------------------

. 
end of do-file

. merge m:1 industry_code using `industry', nogen keep(master match) keepusing(
> industry_label ces_employment growth)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           464,804  
    -----------------------------------------

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(15,186 observations deleted)

. 
. * regional employment weight from CBP, sectoral weight from CES
. tempvar sum

. egen `sum' = sum(cond(!missing(population_density,communication_share),employ
> ment,0)), by(industry_code)

. generate employment_weight = cond(!missing(population_density,communication_s
> hare),employment,0)/`sum'*ces_employment
(1,209 missing values generated)

. 
. /* 
> Calibrate epsilon to gamma=1.04 in
> 
> Ciccone, Antonio, and Robert Hall. 1996. “Productivity and the Density of Eco
> nomic Activity.” 
> The American Economic Review 86 (1): 54–70.
> 
> page 62.
> 
> density^agglomeration = density^(epsilon * chi)
> */
. scalar agglomeration = 0.04

. generate LHS = agglomeration * ln(population_density)
(5,984 missing values generated)

. generate RHS = (communication_share/100) * ln(population_density)
(5,984 missing values generated)

. 
. regress LHS RHS [aw=employment_weight]
(sum of wgt is 115,601.595430615)

      Source |       SS           df       MS      Number of obs   =   442,430
-------------+----------------------------------   F(1, 442428)    =  90905.81
       Model |  332.465899         1  332.465899   Prob > F        =    0.0000
    Residual |  1618.07293   442,428  .003657257   R-squared       =    0.1704
-------------+----------------------------------   Adj R-squared   =    0.1704
       Total |  1950.53883   442,429  .004408705   Root MSE        =    .06048

------------------------------------------------------------------------------
         LHS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         RHS |   .0197359   .0000655   301.51   0.000     .0196076    .0198642
       _cons |   .2116621   .0001693  1250.52   0.000     .2113303    .2119938
------------------------------------------------------------------------------

. scalar epsilon = _b[RHS]

. generate chi = communication_share/100

. generate gamma = chi/(1-chi)

. 
. * use actual drop in visits between Feb 2020 and last week of March to calcul
> ate contact ratio
. merge 1:1 industry_code zip using "../data/derived/change-in-visits.dta", nog
> en keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                       149,129
        from master                   149,129  
        from using                          0  

    matched                           300,489  
    -----------------------------------------

. * interpolate missing safegraph data from industry mean
. reg gr_visits i.industry_code [aw=employment_weight],
(sum of wgt is 85,550.3583683134)

      Source |       SS           df       MS      Number of obs   =   299,718
-------------+----------------------------------   F(60, 299657)   =   2815.07
       Model |  9532.89007        60  158.881501   Prob > F        =    0.0000
    Residual |   16912.548   299,657  .056439689   R-squared       =    0.3605
-------------+----------------------------------   Adj R-squared   =    0.3603
       Total |   26445.438   299,717  .088234695   Root MSE        =    .23757

------------------------------------------------------------------------------
   gr_visits |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
industry_c~e |
        236  |   -.152431   .0157806    -9.66   0.000    -.1833605   -.1215016
        238  |  -.0657914   .0090695    -7.25   0.000    -.0835674   -.0480154
        311  |  -.1489608   .0093233   -15.98   0.000    -.1672341   -.1306874
        312  |  -.4552813   .0112741   -40.38   0.000    -.4773783   -.4331844
        314  |  -.2048236   .1292512    -1.58   0.113    -.4581523    .0485052
        321  |  -.0885783   .1962047    -0.45   0.652     -.473134    .2959774
        323  |  -.1834401   .0119274   -15.38   0.000    -.2068175   -.1600628
        325  |   -.480284    .127798    -3.76   0.000    -.7307645   -.2298034
        327  |  -.0336592   .0280757    -1.20   0.231    -.0886868    .0213684
        331  |  -.0345043   .0372355    -0.93   0.354    -.1074848    .0384761
        332  |  -.0564686   .0130076    -4.34   0.000    -.0819632    -.030974
        333  |  -.3688511   .1850493    -1.99   0.046    -.7315426   -.0061596
        334  |  -.4446639    .053493    -8.31   0.000    -.5495087   -.3398191
        336  |  -.0166363   .0309842    -0.54   0.591    -.0773645    .0440919
        339  |  -.1798965   .0106348   -16.92   0.000    -.2007404   -.1590526
        423  |  -.0581308   .0090095    -6.45   0.000     -.075789   -.0404725
        424  |  -.0275672   .0095447    -2.89   0.004    -.0462746   -.0088598
        441  |  -.0838604   .0091207    -9.19   0.000    -.1017366   -.0659841
        442  |  -.3417503   .0105181   -32.49   0.000    -.3623654   -.3211352
        443  |  -.2675183   .0105339   -25.40   0.000    -.2881644   -.2468721
        444  |   .0815423   .0093695     8.70   0.000     .0631784    .0999062
        445  |  -.0018098   .0089762    -0.20   0.840     -.019403    .0157833
        446  |   -.174921   .0095231   -18.37   0.000     -.193586   -.1562561
        447  |  -.0388615   .0096131    -4.04   0.000    -.0577029     -.02002
        448  |  -.5487345   .0093829   -58.48   0.000    -.5671247   -.5303442
        451  |  -.4052643   .0102624   -39.49   0.000    -.4253783   -.3851504
        452  |  -.1439082   .0089794   -16.03   0.000    -.1615075   -.1263089
        453  |  -.3237797   .0097493   -33.21   0.000    -.3428881   -.3046714
        454  |  -.0525166   .0216177    -2.43   0.015    -.0948867   -.0101466
        484  |  -.0453203   .0114597    -3.95   0.000    -.0677811   -.0228595
        485  |   -.242641   .0127681   -19.00   0.000    -.2676661    -.217616
        488  |  -.1632402   .0100701   -16.21   0.000    -.1829774    -.143503
        492  |   .0652669   .0099906     6.53   0.000     .0456856    .0848481
        493  |   -.036013   .0146981    -2.45   0.014    -.0648208   -.0072052
        511  |   .1978458   .1280048     1.55   0.122      -.05304    .4487317
        512  |  -.5101427   .0107102   -47.63   0.000    -.5311343   -.4891511
        515  |  -.1606566   .0389327    -4.13   0.000    -.2369637   -.0843495
        517  |  -.2813249   .0099891   -28.16   0.000    -.3009033   -.2617466
        518  |  -.2568875   .0283248    -9.07   0.000    -.3124033   -.2013716
        519  |  -.5360272   .0120052   -44.65   0.000    -.5595571   -.5124973
        521  |  -.1241157   .0090195   -13.76   0.000    -.1417936   -.1064377
        523  |  -.3586019   .0096393   -37.20   0.000    -.3774947   -.3397091
        524  |  -.2410338   .0090084   -26.76   0.000      -.25869   -.2233777
        531  |  -.3100702   .0092318   -33.59   0.000    -.3281642   -.2919762
        532  |  -.1041724   .0102416   -10.17   0.000    -.1242457   -.0840992
        541  |  -.1039219   .0087826   -11.83   0.000    -.1211355   -.0867083
        551  |  -.1077342   .0165307    -6.52   0.000    -.1401338   -.0753345
        561  |  -.0450096   .0088018    -5.11   0.000     -.062261   -.0277583
        562  |   .0242372   .0114923     2.11   0.035     .0017127    .0467618
        611  |  -.6047625   .0089206   -67.79   0.000    -.6222466   -.5872784
        623  |  -.1166084   .0090101   -12.94   0.000    -.1342679    -.098949
        624  |  -.3845979   .0088993   -43.22   0.000    -.4020403   -.3671555
        711  |  -.6022814   .0139737   -43.10   0.000    -.6296694   -.5748934
        712  |  -.3919089   .0129531   -30.26   0.000    -.4172967   -.3665211
        713  |  -.4667681   .0091892   -50.80   0.000    -.4847788   -.4487575
        721  |   -.461949   .0091224   -50.64   0.000    -.4798286   -.4440694
        722  |  -.3823482   .0087588   -43.65   0.000    -.3995151   -.3651813
        811  |   .0001659   .0093375     0.02   0.986    -.0181354    .0184671
        812  |  -.2019979   .0092716   -21.79   0.000      -.22017   -.1838257
        813  |  -.3823938   .0089873   -42.55   0.000    -.4000087   -.3647789
             |
       _cons |  -.1978458   .0086809   -22.79   0.000      -.21486   -.1808316
------------------------------------------------------------------------------

. tempvar hat

. predict `hat', xb

. replace gr_visits = `hat' if missing(gr_visits)
(149,129 real changes made)

. 
. generate contact_ratio = 1 + gr_visits

. * Eq 6 from the paper
. generate labor_subsidy = 100 - 100 * (1 - chi*contact_ratio) * (contact_ratio
> )^gamma / (1-chi)

. summarize labor_subsidy [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
labor_subs~y | 442,887    115789.7    17.38905   24.30661  -1.42e-14        100

. 
. * compute for nyc
. merge m:1 zip using "nyc_zip.dta", keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                       443,603
        from master                   443,603  (_merge==1)
        from using                          0  (_merge==2)

    matched                             6,015  (_merge==3)
    -----------------------------------------

. generate nyc = (_m==3)

. summarize population_density if nyc==1 [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
population~y |   6,014  3941.66245    19315.45   12218.79          0   57231.17

. summarize labor_subsidy if nyc==1 [aw=employment_weight]

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
labor_subs~y |   6,014  3941.66245     26.1386   28.57253  -1.42e-14        100

. 
. save "wage_subsidy.dta", replace
file wage_subsidy.dta saved

. do "employment-growth.do"

. preserve

.         generate wage_subsidy = employment_weight * labor_subsidy
(1,209 missing values generated)

.         collapse (firstnm) ces_employment growth (sum) wage_subsidy employmen
> t_weight, by(industry_code industry_label)

.         replace wage_subsidy =  wage_subsidy / employment_weight
(80 real changes made, 2 to missing)

.         
.         generate str label = ""
(81 missing values generated)

.         replace label = industry_label if inlist(industry_code, 487, 722, 442
> , 448, 452, 519, 486, 113, 451, 721, 446)
variable label was str1 now str45
(11 real changes made)

.         
.         tw ///
>         (lfitci growth wage_subsidy [aw=ces_employment]  ) ///
>         (scatter growth wage_subsidy [aw=ces_employment],  msymbol(circle_hol
> low) mlabel(label)), ///
>         scheme(s2mono) graphregion(color(white)) ///
>         ytitle("Change in monthly employment (%)" ) ///
>         xtitle("Wage subsidy to compensate drop in contacts (percent)") ///
>         legend(region(lstyle(none)) order(2 "Regression line" 1 "Confidence i
> nterval")) ///
>         graphregion(margin(1 40 1 1)) aspect(1)

.         
.         graph export "../text/fig5.eps", replace
(file ../text/fig5.eps written in EPS format)

.         graph export "../text/fig5.pdf", replace
(file ../text/fig5.pdf written in PDF format)

.         graph export "../text/fig5.png", replace
translator Graph2png not found
r(111);

end of do-file
r(111);

end of do-file
r(111);
