
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create-index.do 

. clear all

. 
. import delimited "../data/derived/crosswalk/industry.csv", varnames(1) clear 
> case(preserve)
(3 vars, 82 obs)

. merge 1:1 industry_code using "../data/clean/industry-employment/industry-emp
> loyment.dta", nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                            10
        from master                        10  
        from using                          0  

    matched                                72  
    -----------------------------------------

. rename employment ces_employment

. tempfile industry

. save `industry', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St27358.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St27358.000001 saved

. 
. 
. do "industry_location_panel.do"

. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(6 vars, 74 obs)

. tempfile occupation

. save `occupation', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St27358.000002 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St27358.000002 saved

. 
. use "../data/clean/cbp/zip_code_business_patterns.dta", clear

. merge m:1 industry_code using `occupation', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           376,589  
    -----------------------------------------

. 
end of do-file

. do "calculate-exposure.do"

. generate teamwork_exposure = teamwork_share/100 * ln(employment_density)
(5,654 missing values generated)

. generate customer_exposure = customer_share/100 * ln(population_density)
(6,099 missing values generated)

. generate presence_exposure = presence_share/100 * ln(plant_size)

. generate overall_exposure  = affected_share/100 * ln(population_density)
(6,099 missing values generated)

. 
. foreach X of var *_exposure {
  2.         summarize `X'
  3.         replace `X' = round(`X'/r(max)*100)
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_e~e |    370,935    .8536221    .6850916  -1.523123   5.519412
(370,935 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_e~e |    370,490    1.192858     .985739  -2.095043   6.515367
(370,490 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_e~e |    376,589    .1934092    .2864322          0    3.19715
(302,589 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ex~e |    370,490    2.213308    1.251919  -3.196601   8.290633
(370,490 real changes made)

. 
. label variable teamwork_exposure "Social distancing effect on teamwork (max=1
> 00)"

. label variable customer_exposure "Social distancing effect on customer contac
> t (max=100)"

. label variable presence_exposure "Social distancing effect on physical presen
> ce (max=100)"

. label variable overall_exposure "Social distancing exposure (max=100)"

. 
. 
end of do-file

. 
. merge m:1 industry_code using `industry', nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           376,589  
    -----------------------------------------

. 
. * check correlation betwen CES and CBP employment estimates
. egen cbp_employment = sum(employment / 1000), by(industry_code)

. 
. corr cbp_employment ces_employment 
(obs=371,090)

             | cbp_em~t ces_em~t
-------------+------------------
cbp_employ~t |   1.0000
ces_employ~t |   0.9808   1.0000


. assert r(rho)>0.98

. 
. local vars  teamwork_share customer_share presence_share communication_share 
> affected_share teamwork_exposure customer_exposure presence_exposure overall_
> exposure population_density employment_density plant_size

. keep industry_code industry_label `vars'

. order industry_code industry_label `vars'

. 
. collapse (mean) `vars' [aw=employment], by(industry_code industry_label)

. 
. * merge on CES employment to be able to calculate weighted statistics
. merge 1:1 industry_code using `industry', nogen keep(master match) keepusing(
> ces_employment)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                69  
    -----------------------------------------

. 
. foreach X of var *_share *_exposure {
  2.         replace `X' = round(`X')
  3.         format `X' %10.0f
  4. }
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(69 real changes made)
(69 real changes made)
(59 real changes made)
(69 real changes made)

. foreach X of var *_density plant_size ces_employment {
  2.         replace `X' = round(`X'*10)/10
  3.         format `X' %11.1f
  4. }
(69 real changes made)
(64 real changes made)
(69 real changes made)
(0 real changes made)

. 
. label variable teamwork_share "Workers in teamwork-intensive occupations (per
> cent)"

. label variable customer_share "Workers in customer-facing occupations (percen
> t)"

. label variable presence_share "Workers in occupations requiring physical pres
> ence (percent)"

. label variable communication_share "Workers in communication-intensive occupa
> tions (percent)"

. label variable affected_share "Workers in any of the three groups (percent)"

. 
. label variable teamwork_exposure "Teamwork exposure to social distancing"

. label variable customer_exposure "Customer contact exposure to social distanc
> ing"

. label variable presence_exposure "Physical presence exposure to social distan
> cing"

. label variable overall_exposure "Overall exposure to social distancing"

. 
. label variable population_density "Population density in the average ZIP code
>  of business (person/km2)"

. label variable employment_density "Employment density in the average ZIP code
>  of business (person/km2)"

. label variable plant_size "Average plant size (person)"

. label variable ces_employment "Industry employment (thousand persons)"

. 
. gsort -overall_exposure

. 
. save "../data/derived/industry-index.dta", replace
file ../data/derived/industry-index.dta saved

. export delimited "../data/derived/industry-index.csv", replace
file ../data/derived/industry-index.csv saved

. 
end of do-file
