
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create-index.do 

. clear all

. import delimited "../data/derived/crosswalk/industry.csv", varnames(1) clear 
> case(preserve)
(3 vars, 82 obs)

. tempfile industry

. save `industry', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05608.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05608.000001 saved

. 
. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(3 vars, 74 obs)

. tempfile occupation

. save `occupation', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05608.000002 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St05608.000002 saved

. 
. import delimited "../data/derived/agglomeration/high_density_employment.csv",
>  varnames(1) clear
(3 vars, 69 obs)

. 
. merge 1:1 industry_code using `occupation', nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             5
        from master                         0  
        from using                          5  

    matched                                69  
    -----------------------------------------

. merge 1:1 industry_code using `industry', nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                74  
    -----------------------------------------

. merge 1:1 industry_code using "../data/clean/industry-employment/industry-emp
> loyment.dta", nogen keep(master match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             2
        from master                         2  
        from using                          0  

    matched                                72  
    -----------------------------------------

. 
. * check correlation betwen CES and CBP employment estimates
. replace cbp_employment = cbp_employment / 1000
variable cbp_employment was long now double
(69 real changes made)

. rename employment ces_employment

. 
. corr cbp_employment ces_employment 
(obs=67)

             | cbp_em~t ces_em~t
-------------+------------------
cbp_employ~t |   1.0000
ces_employ~t |   0.9606   1.0000


. assert r(rho)>0.95

. 
. * median employment density in manufacturing
. summarize average_density if industry_code>=311 & industry_code<=339 [aw=ces_
> employment], d

                       average_density
-------------------------------------------------------------
      Percentiles      Smallest
 1%     42.83066       42.83066
 5%     96.03396       96.03396
10%     195.9472       139.7932       Obs                  18
25%     212.2241       195.9472       Sum of Wgt.    12,459.8

50%     285.9398                      Mean           374.5692
                        Largest       Std. Dev.      423.1683
75%     371.4427       640.5076
90%     681.2455       681.2455       Variance       179071.4
95%     741.5516       741.5516       Skewness       6.553168
99%     3807.548       3807.548       Kurtosis       54.51225

. scalar median_density = r(p50)

. 
. generate social_distancing_exposure = (average_density / median_density) ^ (h
> igh_communication/100)
(5 missing values generated)

. 
. local vars industry_code industry_label high_communication high_infection ave
> rage_density social_distancing_exposure ces_employment

. keep `vars'

. order `vars'

. 
. * trim variables for presentation
. replace social_distancing_exposure = round(social_distancing_exposure*100)
(69 real changes made)

. replace average_density = round(average_density)
(69 real changes made)

. rename high_communication communication_share

. rename high_infection infection_share

. rename average_density average_employment_density

. rename ces_employment employment

. 
. label variable communication_share "Share of workers in communication-intensi
> ve occupations (percent)"

. label variable infection_share "Share of workers in infection-prone occupatio
> ns (percent)"

. label variable average_employment_density "Employment density in the average 
> ZIP code of business (person/km2)"

. label variable social_distancing_exposure "Combined index of social distancin
> g exposure (manufacturing=100)"

. label variable employment "Industry employment (thousand persons)"

. 
. gsort -social_distancing_exposure

. 
. save "../data/derived/industry-index.dta", replace
file ../data/derived/industry-index.dta saved

. export delimited "../data/derived/industry-index.csv", replace
file ../data/derived/industry-index.csv saved

. 
end of do-file
