
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do headcount.do 

. clear all

. use "../data/derived/industry-index.dta"

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(2 observations deleted)

. 
. * cumulate employment
. gsort -social_distancing_exposure

. generate sum_employment = sum(employment)

. * the 10 most exposed sectors employ
. list sum_employment in 10

     +----------+
     | sum_em~t |
     |----------|
 10. |  22901.1 |
     +----------+

. 
. generate naics_2d = industry_code if industry_code<100
(69 missing values generated)

. replace naics_2d = int(industry_code/10) if industry_code>=100
(69 real changes made)

. 
. * employment-weighted average
. foreach X of var *_share social {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
variable communication_share was byte now float
(67 real changes made, 2 to missing)
(0 real changes made)
variable infection_share was byte now float
(71 real changes made, 2 to missing)
(0 real changes made)
(67 real changes made, 2 to missing)
(5 real changes made, 5 to missing)

. collapse (sum) employment (sum) communication_share infection_share social_di
> stancing (firstnm) industry_label, by(naics_2d)

. foreach X of var *_share social {
  2.         replace `X' = `X' / employment
  3. }
(23 real changes made)
(23 real changes made)
(23 real changes made)

. gsort -social_distancing_exposure

. generate sum_employment = sum(employment)

. list industry_label sum_employment in 1/3

     +---------------------------------------------------------------------+
  1. |                                                      industry_label |
     |                                                  Education services |
     |---------------------------------------------------------------------|
     |                              sum_em~t                               |
     |                                3727.5                               |
     +---------------------------------------------------------------------+

     +---------------------------------------------------------------------+
  2. |                                                      industry_label |
     |                                            Food and beverage stores |
     |---------------------------------------------------------------------|
     |                              sum_em~t                               |
     |                               16455.7                               |
     +---------------------------------------------------------------------+

     +---------------------------------------------------------------------+
  3. |                                                      industry_label |
     | Monetary authorities, credit intermediation, and related activities |
     |---------------------------------------------------------------------|
     |                              sum_em~t                               |
     |                               22769.6                               |
     +---------------------------------------------------------------------+

. 
end of do-file
