
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do headcount.do 

. clear all

. * calculate urban density cutoff
. 
. use "../data/derived/industry-index.dta", clear

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(2 observations deleted)

. 
. replace ces_employment = int(ces_employment*1000)
(80 real changes made)

. foreach X of var *_share {
  2.         summarize `X' [fw=ces_employment]
  3.         display "Millions of workers: " r(mean)/100 * r(sum_w) / 1e+6
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_s~e |116,656,999    10.49821    4.870516          4         31
Millions of workers: 12.246894

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_s~e |116,656,999    31.10812     21.3749          3         90
Millions of workers: 36.289799

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_s~e |116,656,999    8.304217    12.92018          0         66
Millions of workers: 9.6874504

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
communicat~e |116,656,999    34.29906    19.64212          7         91
Millions of workers: 40.012257

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
affected_s~e |116,656,999    41.69611    17.85819         13         91
Millions of workers: 48.641433

. 
. generate naics_2d = industry_code if industry_code<100
(82 missing values generated)

. replace naics_2d = int(industry_code/10) if industry_code>=100
(82 real changes made)

. 
. * employment-weighted average
. foreach X of var *_share {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
employment not found
r(111);

end of do-file
r(111);
