
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do headcount.do 

. clear all

. * calculate urban density cutoff
. 
. * https://www.census.gov/library/publications/2012/dec/cph-2.html, Table 8
. * For Metropolitan Areas only
. scalar urban_population = 228004779

. scalar urban_area = 91697.21 * (1.61)^2

. scalar urban_density = urban_population / urban_area

. 
. scalar list
urban_density =  959.25943
urban_area =  237688.34
urban_population =  2.280e+08

. 
. use "../data/derived/industry-index.dta", clear

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(2 observations deleted)

. 
. * cumulate employment
. gsort -social_distancing_exposure

. generate sum_employment = sum(employment)

. * the 10 most exposed sectors employ
. list sum_employment in 10

     +----------+
     | sum_em~t |
     |----------|
 10. |  22901.1 |
     +----------+

. 
. * most dense
. gsort -average_population_density

. list industry_label in 1/10

     +------------------------------------------------------------------------+
     | industry_label                                                         |
     |------------------------------------------------------------------------|
  1. | Performing arts, spectator sports, and related industries              |
  2. | Other information services                                             |
  3. | Motion picture, video, and sound recording industries                  |
  4. | Apparel, leather and allied product manufacturing                      |
  5. | Broadcasting (except Internet)                                         |
     |------------------------------------------------------------------------|
  6. | Securities, commodity contracts, funds, trusts and other financial i.. |
  7. | Museums, historical sites, and similar institutions                    |
  8. | Publishing industries                                                  |
  9. | Education services                                                     |
 10. | Transit and ground passenger transportation                            |
     +------------------------------------------------------------------------+

. 
. * urban and communicative
. scalar cutoff = 1000

. summarize communication_share if (average_population_density>=cutoff)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
communicat~e |         47    14.02128    16.47988          0         62

. 
. generate exposed = (average_population_density>=cutoff) & (communication_shar
> e>=25)

. summarize employment if exposed==1, detail

           Industry employment (thousand persons)
-------------------------------------------------------------
      Percentiles      Smallest
 1%        436.3          436.3
 5%        436.3          487.5
10%        461.9         1509.5       Obs                  10
25%       1509.5         2666.6       Sum of Wgt.          10

50%      2888.75                      Mean            2869.19
                        Largest       Std. Dev.      2032.109
75%       3362.2         3104.9
90%       5673.7         3362.2       Variance        4129468
95%       7619.9         3727.5       Skewness       1.082479
99%       7619.9         7619.9       Kurtosis       4.203497

. display r(sum)
28691.9

. 
. generate naics_2d = industry_code if industry_code<100
(69 missing values generated)

. replace naics_2d = int(industry_code/10) if industry_code>=100
(69 real changes made)

. 
. * employment-weighted average
. foreach X of var *_share social {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
variable communication_share was byte now float
(67 real changes made, 2 to missing)
(0 real changes made)
variable infection_share was byte now float
(71 real changes made, 2 to missing)
(0 real changes made)
(67 real changes made, 2 to missing)
(5 real changes made, 5 to missing)

. collapse (sum) employment (sum) communication_share infection_share social_di
> stancing (firstnm) industry_label, by(naics_2d)

. foreach X of var *_share social {
  2.         replace `X' = `X' / employment
  3. }
(23 real changes made)
(23 real changes made)
(23 real changes made)

. gsort -social_distancing_exposure

. generate sum_employment = sum(employment)

. list industry_label sum_employment in 1/5

     +------------------------------------------------------------------------+
  1. | industry_label                                                         |
     | Education services                                                     |
     |------------------------------------------------------------------------|
     |                                sum_em~t                                |
     |                                  3727.5                                |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  2. | industry_label                                                         |
     | Food and beverage stores                                               |
     |------------------------------------------------------------------------|
     |                                sum_em~t                                |
     |                                 16455.7                                |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  3. | industry_label                                                         |
     | Securities, commodity contracts, funds, trusts and other financial i.. |
     |------------------------------------------------------------------------|
     |                                sum_em~t                                |
     |                                 22769.6                                |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  4. | industry_label                                                         |
     | Religious, grantmaking, civic, professional, and similar organizatons  |
     |------------------------------------------------------------------------|
     |                                sum_em~t                                |
     |                                 28614.2                                |
     +------------------------------------------------------------------------+

     +------------------------------------------------------------------------+
  5. | industry_label                                                         |
     | Other information services                                             |
     |------------------------------------------------------------------------|
     |                                sum_em~t                                |
     |                                 31442.3                                |
     +------------------------------------------------------------------------+

. 
end of do-file
