
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do headcount.do 

. clear all

. * calculate urban density cutoff
. 
. use "../data/derived/industry-index.dta", clear

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(2 observations deleted)

. 
. replace ces_employment = int(ces_employment*1000)
(65 real changes made)

. foreach X of var *_share {
  2.         summarize `X' [fw=ces_employment]
  3.         display "Millions of workers: " r(mean)/100 * r(sum_w) / 1e+6
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_s~e |113,049,400    22.85383    12.35028          5         50
Millions of workers: 25.836119

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_s~e |113,049,400    31.43124    20.93571          3         74
Millions of workers: 35.532823

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_s~e |113,049,400    8.022725    12.29342          0         66
Millions of workers: 9.069642

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
communicat~e |113,049,400    43.13084    17.89304          8         75
Millions of workers: 48.759154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
affected_s~e |113,049,400    50.49341    15.14627         18         80
Millions of workers: 57.082502

. 
. generate naics_2d = industry_code if industry_code<100
(64 missing values generated)

. replace naics_2d = int(industry_code/10) if industry_code>=100
(64 real changes made)

. 
. * employment-weighted average
. foreach X of var *_share {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
(67 real changes made)
(0 real changes made)
(67 real changes made)
(0 real changes made)
(58 real changes made)
(0 real changes made)
(67 real changes made)
(0 real changes made)
(67 real changes made)
(0 real changes made)

. collapse (sum) employment (sum) teamwork_share customer_share presence_share 
> communication_share affected_share customer_exposure (firstnm) industry_label
> , by(naics_2d)

. foreach X of var *_share {
  2.         replace `X' = `X' / employment
  3. }
(23 real changes made)
(23 real changes made)
(22 real changes made)
(23 real changes made)
(23 real changes made)

. gsort -customer_exposure

. generate sum_employment = sum(employment)

. list industry_label sum_employment in 1/5

     +----------------------------------------------------------------+
     |                                      industry_label   sum_em~t |
     |----------------------------------------------------------------|
  1. |                                    All other retail   236856.1 |
  2. |                                  Telecommunications    1027938 |
  3. | Museums, historical sites, and similar institutions    1277922 |
  4. |                               Repair and mantenance    1635397 |
  5. |                                         Real estate    1959038 |
     +----------------------------------------------------------------+

. 
. clear all

. 
. do "industry_location_panel.do"

. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(6 vars, 74 obs)

. tempfile occupation

. save `occupation', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St29026.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St29026.000001 saved

. 
. use "../data/clean/cbp/zip_code_business_patterns.dta", clear

. merge m:1 industry_code using `occupation', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           376,589  
    -----------------------------------------

. 
end of do-file

. do "calculate-exposure.do"

. generate teamwork_exposure = teamwork_share/100 * ln(employment_density)
(5,654 missing values generated)

. generate customer_exposure = customer_share/100 * ln(population_density)
(6,099 missing values generated)

. generate presence_exposure = presence_share/100 * ln(plant_size)

. generate overall_exposure  = affected_share/100 * ln(population_density)
(6,099 missing values generated)

. 
. foreach X of var *_exposure {
  2.         summarize `X'
  3.         replace `X' = round(`X'/r(max)*100)
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_e~e |    370,935     1.04078     .824821  -1.575394   6.560357
(370,935 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_e~e |    370,490    1.714174    1.326634  -2.846097   7.985538
(370,490 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_e~e |    376,589    .2047561    .2952307          0   3.246337
(309,596 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ex~e |    370,490    2.878717    1.348411   -3.37419   8.520495
(370,490 real changes made)

. 
. label variable teamwork_exposure "Social distancing effect on teamwork (max=1
> 00)"

. label variable customer_exposure "Social distancing effect on customer contac
> t (max=100)"

. label variable presence_exposure "Social distancing effect on physical presen
> ce (max=100)"

. label variable overall_exposure "Social distancing exposure (max=100)"

. 
. 
end of do-file

. 
. * of which urban
. drop if population_density < 1000
(268,492 observations deleted)

. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(4,134 observations deleted)

. foreach X of var *_share {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
variable teamwork_share was byte now long
(103,963 real changes made)
(0 real changes made)
variable customer_share was byte now long
(103,963 real changes made)
(0 real changes made)
variable presence_share was byte now long
(83,725 real changes made)
(0 real changes made)
variable communication_share was byte now long
(103,963 real changes made)
(0 real changes made)
variable affected_share was byte now long
(103,963 real changes made)
(0 real changes made)

. collapse (sum) teamwork_share customer_share presence_share communication_sha
> re affected_share employment, by(industry_code)

. foreach X of var *_share {
  2.         replace `X' = `X' / employment
  3. }
(67 real changes made)
(67 real changes made)
(58 real changes made)
(67 real changes made)
(67 real changes made)

. replace employment = int(employment)
(0 real changes made)

. 
. foreach X of var *_share {
  2.         summarize `X' [fw=employment]
  3.         display "Millions of workers: " r(mean)/100 * r(sum_w) / 1e+6
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_s~e | 38,187,045    24.73976    13.16483          5         50
Millions of workers: 9.4473832

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_s~e | 38,187,045    32.64106    18.29045          3         74
Millions of workers: 12.464656

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_s~e | 38,187,045    6.378864    10.45405          0         66
Millions of workers: 2.4358997

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
communicat~e | 38,187,045    45.42835     15.1881          8         75
Millions of workers: 17.347744

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
affected_s~e | 38,187,045    51.24741    12.89844         18         80
Millions of workers: 19.569871

. 
end of do-file
