
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do headcount.do 

. clear all

. * calculate urban density cutoff
. 
. use "../data/derived/industry-index.dta", clear

. 
. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(2 observations deleted)

. 
. replace ces_employment = int(ces_employment*1000)
(79 real changes made)

. foreach X of var *_share {
  2.         summarize `X' [fw=ces_employment]
  3.         display "Millions of workers: " r(mean)/100 * r(sum_w) / 1e+6
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_s~e |116,498,199    22.90905    12.47579          5         50
Millions of workers: 26.688627

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_s~e |116,498,199    31.13826    21.37387          3         90
Millions of workers: 36.275507

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_s~e |116,498,199    8.262375    12.87915          0         66
Millions of workers: 9.6255184

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
communicat~e |116,498,199    42.89975    18.29325          8         91
Millions of workers: 49.977432

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
affected_s~e |116,498,199    50.44518    15.45256         18         91
Millions of workers: 58.767722

. 
. generate naics_2d = industry_code if industry_code<100
(81 missing values generated)

. replace naics_2d = int(industry_code/10) if industry_code>=100
(81 real changes made)

. 
. * employment-weighted average
. foreach X of var *_share {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
(81 real changes made)
(0 real changes made)
(81 real changes made)
(0 real changes made)
(70 real changes made)
(0 real changes made)
(81 real changes made)
(0 real changes made)
(81 real changes made)
(0 real changes made)

. collapse (sum) employment (sum) teamwork_share customer_share presence_share 
> communication_share affected_share customer_exposure (firstnm) industry_label
> , by(naics_2d)

. foreach X of var *_share {
  2.         replace `X' = `X' / employment
  3. }
(23 real changes made)
(23 real changes made)
(22 real changes made)
(23 real changes made)
(23 real changes made)

. gsort -customer_exposure

. generate sum_employment = sum(employment)

. list industry_label sum_employment in 1/5

     +----------------------------------------------------------------+
     |                                      industry_label   sum_em~t |
     |----------------------------------------------------------------|
  1. |                     Health and personal care stores   451328.2 |
  2. |       Sporting goods, hobby, book, and music stores   687883.2 |
  3. |                          Other information services    1478965 |
  4. |                                  Air transportation    1973029 |
  5. | Museums, historical sites, and similar institutions    2223013 |
     +----------------------------------------------------------------+

. 
. clear all

. 
. do "industry_location_panel.do"

. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(6 vars, 84 obs)

. tempfile occupation

. save `occupation', replace
(note: file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St05050.000001 no
> t found)
file /var/folders/7b/svcv81g94n3fm6nrj7ckr15c0000gn/T//St05050.000001 saved

. 
. use "../data/clean/cbp/zip_code_business_patterns.dta", clear

. merge m:1 industry_code using `occupation', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           464,804  
    -----------------------------------------

. 
end of do-file

. do "calculate-exposure.do"

. generate teamwork_exposure = teamwork_share/100 * ln(employment_density)
(5,824 missing values generated)

. generate customer_exposure = customer_share/100 * ln(population_density)
(6,294 missing values generated)

. generate presence_exposure = presence_share/100 * ln(plant_size)

. generate overall_exposure  = affected_share/100 * ln(population_density)
(6,294 missing values generated)

. 
. foreach X of var *_exposure {
  2.         summarize `X'
  3.         replace `X' = round(`X'/r(max)*100)
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_e~e |    458,980     1.02599    .7788558  -1.575394   6.560357
(458,980 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_e~e |    458,510    1.930914    1.609443  -3.280917   9.831341
(458,510 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_e~e |    464,804     .193983    .2846667          0   3.246337
(381,514 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ex~e |    458,510     3.03745    1.469592  -3.399505   9.940578
(458,510 real changes made)

. 
. label variable teamwork_exposure "Social distancing effect on teamwork (max=1
> 00)"

. label variable customer_exposure "Social distancing effect on customer contac
> t (max=100)"

. label variable presence_exposure "Social distancing effect on physical presen
> ce (max=100)"

. label variable overall_exposure "Social distancing exposure (max=100)"

. 
. 
end of do-file

. 
. * of which urban
. drop if population_density < 1000
(328,404 observations deleted)

. * drop hospitals and clinics
. drop if inlist(industry_code, 621, 622)
(4,134 observations deleted)

. foreach X of var *_share {
  2.         replace `X' = `X' * employment
  3.         replace employment = . if missing(`X')
  4. }
variable teamwork_share was byte now long
(132,266 real changes made)
(0 real changes made)
variable customer_share was byte now long
(132,266 real changes made)
(0 real changes made)
variable presence_share was byte now long
(106,124 real changes made)
(0 real changes made)
variable communication_share was byte now long
(132,266 real changes made)
(0 real changes made)
variable affected_share was byte now long
(132,266 real changes made)
(0 real changes made)

. collapse (sum) teamwork_share customer_share presence_share communication_sha
> re affected_share employment, by(industry_code)

. foreach X of var *_share {
  2.         replace `X' = `X' / employment
  3. }
(81 real changes made)
(81 real changes made)
(70 real changes made)
(81 real changes made)
(81 real changes made)

. replace employment = int(employment)
(0 real changes made)

. 
. foreach X of var *_share {
  2.         summarize `X' [fw=employment]
  3.         display "Millions of workers: " r(mean)/100 * r(sum_w) / 1e+6
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_s~e | 37,020,146    24.92679    13.40574          5         50
Millions of workers: 9.2279325

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_s~e | 37,020,146    33.69251    19.57374          3         90
Millions of workers: 12.473017

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_s~e | 37,020,146    6.098823    10.88293          0         66
Millions of workers: 2.2577932

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
communicat~e | 37,020,146    46.40141    16.18013          8         91
Millions of workers: 17.177871

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
affected_s~e | 37,020,146    51.94053    13.80185         18         91
Millions of workers: 19.228461

. 
end of do-file
