
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do risk-by-density.do 

. clear all

. use "../data/derived/industry-index.dta", clear

. 
. tempfile sector_risk

. save  `sector_risk'
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St08773.000001 saved

. 
. use "../data/clean/cbp/zip_code_business_patterns.dta", clear

. merge m:1 industry_code using  `sector_risk', keep(match) nogen
(note: variable employment was long, now double to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           376,589  
    -----------------------------------------

. 
. collapse (first) population_density employment_density median_density (mean) 
> communication_share infection_share [fw=employment], by(zip)

. *drop rural areas, CBP is not representative for these
. drop if population_density<5
(2,396 observations deleted)

. 
. * compute zip-level exposure index
. clonevar average_population_density = population_density
(2,428 missing values generated)

. do "calculate-exposure.do"

. generate social_distancing_exposure = (average_population_density / median_de
> nsity) ^ (communication_share/100)
(2,428 missing values generated)

. replace social_distancing_exposure = round(social_distancing_exposure*100)
(21,987 real changes made)

. label variable social_distancing_exposure "Combined index of social distancin
> g exposure (manufacturing=100)"

. 
end of do-file

. 
. generate ln_density = ln(population_density)
(2,428 missing values generated)

. foreach X of var *_share social_distancing_exposure {
  2.         lowess `X' ln_density, bw(0.5) generate(`X'_hat)
  3. }

. 
. line communication_share_hat infection_share_hat social_distancing_exposure_h
> at population_density, sort ///
> ytitle("Average occupation index (log scale)") xtitle("Population density (pe
> rson/km2, log scale)") ///
> scheme(s2mono) graphregion(color(white)) xscale(log) xlabel(10 100 1000 10000
>  100000) ///
> yscale(log) ylabel(10 20 40 80 160 320) ///
> legend(order(1 "Communication" 2 "Infection" 3 "Social distancing"))

. 
. graph export "../text/overleaf/fig4.eps", replace
(file ../text/overleaf/fig4.eps written in EPS format)

. graph export "../text/overleaf/fig4.pdf", replace
(file ../text/overleaf/fig4.pdf written in PDF format)

. 
end of do-file
