
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do risk-by-density.do 

. clear all

. local indexes teamwork_share customer_share presence_share teamwork_exposure 
> customer_exposure presence_exposure

. 
. do "industry_location_panel.do"

. import delimited "../data/derived/occupation/naics_risk.csv", varnames(1) cle
> ar
(6 vars, 74 obs)

. tempfile occupation

. save `occupation', replace
(note: file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St28527.000001 no
> t found)
file /var/folders/w1/7d52g2y563517gpc7n0sv5_r0000gn/T//St28527.000001 saved

. 
. use "../data/clean/cbp/zip_code_business_patterns.dta", clear

. merge m:1 industry_code using `occupation', keep(match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           376,589  
    -----------------------------------------

. 
end of do-file

. do "calculate-exposure.do"

. generate teamwork_exposure = teamwork_share/100 * ln(employment_density)
(5,654 missing values generated)

. generate customer_exposure = customer_share/100 * ln(population_density)
(6,099 missing values generated)

. generate presence_exposure = presence_share/100 * ln(plant_size)

. generate overall_exposure  = affected_share/100 * ln(population_density)
(6,099 missing values generated)

. 
. foreach X of var *_exposure {
  2.         summarize `X'
  3.         replace `X' = round(`X'/r(max)*100)
  4. }

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
teamwork_e~e |    370,935    .8536221    .6850916  -1.523123   5.519412
(370,935 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
customer_e~e |    370,490    1.192858     .985739  -2.095043   6.515367
(370,490 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
presence_e~e |    376,589    .1934092    .2864322          0    3.19715
(302,589 real changes made)

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ex~e |    370,490    2.213308    1.251919  -3.196601   8.290633
(370,490 real changes made)

. 
. label variable teamwork_exposure "Social distancing effect on teamwork (max=1
> 00)"

. label variable customer_exposure "Social distancing effect on customer contac
> t (max=100)"

. label variable presence_exposure "Social distancing effect on physical presen
> ce (max=100)"

. label variable overall_exposure "Social distancing exposure (max=100)"

. 
. 
end of do-file

. 
. foreach X of var `indexes' {
  2.         replace `X' = `X' * employment
  3.         replace employment = 0 if missing(`X')
  4. }
variable teamwork_share was byte now long
(376,589 real changes made)
(0 real changes made)
variable customer_share was byte now long
(376,589 real changes made)
(0 real changes made)
variable presence_share was byte now long
(302,589 real changes made)
(0 real changes made)
(364,303 real changes made)
(5,654 real changes made)
(364,955 real changes made)
(445 real changes made)
(282,039 real changes made)
(0 real changes made)

. collapse (first) population_density employment_density (sum) `indexes' establ
> ishments employment, by(zip)

. foreach X of var `indexes' {
  2.         replace `X' = `X' / employment
  3. }
(26,811 real changes made, 2,518 to missing)
(26,811 real changes made, 2,518 to missing)
(26,481 real changes made, 2,518 to missing)
(26,007 real changes made, 2,518 to missing)
(26,381 real changes made, 2,518 to missing)
(25,757 real changes made, 2,518 to missing)

. generate plant_size = employment / establishments

. 
. * merge coordinates
. merge 1:1 zip using "../data/clean/geonames/us-zip-codes.dta", nogen keep(mas
> ter match)

    Result                           # of obs.
    -----------------------------------------
    not matched                             1
        from master                         1  
        from using                          0  

    matched                            26,810  
    -----------------------------------------

. 
. local vars zip latitude longitude population_density employment_density plant
> _size employment `indexes' 

. keep `vars'

. order `vars'

. * round values for presentation
. replace plant_size = plant_size*10
(24,293 real changes made)

. foreach X of var population_density employment_density plant_size `indexes' {
  2.         replace `X' = round(`X')
  3. }
(24,293 real changes made)
(24,380 real changes made)
(21,652 real changes made)
(21,026 real changes made)
(21,018 real changes made)
(20,959 real changes made)
(20,501 real changes made)
(20,833 real changes made)
(20,845 real changes made)

. replace plant_size = plant_size/10
(24,293 real changes made)

. foreach X of var latitude longitude {
  2.         replace `X' = round(`X'*10000)/10000
  3. }
(0 real changes made)
(0 real changes made)

. 
. gsort -teamwork_exposure

. list in 1/10

     +-----------------------------------------------------------------+
  1. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 98164 |   47.606 | -122.332 |    15385  |   314021  |     19.4  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |      601 |       38 |       18 |        1 |       87 |       28 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   1                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  2. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 10119 |  40.7808 | -73.9772 |     2159  |   262080  |     30.8  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |     7774 |       31 |       17 |        2 |       71 |       19 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   1                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  3. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 14302 |  43.0945 | -79.0567 |     2973  |    24561  |      4.6  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |       32 |       38 |       25 |        1 |       69 |       31 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   0                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  4. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 20535 |  38.8941 | -77.0251 |      619  |    21906  |      6.6  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |       93 |       38 |       18 |        1 |       69 |       18 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   1                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  5. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 10173 |  40.7543 | -73.9796 |      163  |   187444  |      9.5  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |      532 |       31 |       18 |        2 |       68 |       14 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   1                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  6. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     |  7311 |  40.7323 | -74.0754 |     6932  |   179090  |     26.4  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |     3858 |       30 |       17 |        1 |       65 |       23 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   1                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  7. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 29202 |  34.0007 | -81.0348 |     5531  |    54572  |      7.3  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |      256 |       33 |       28 |        2 |       65 |       37 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   1                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  8. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 10165 |  40.7524 | -73.9791 |      153  |   314137  |      7.9  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |     2199 |       27 |       18 |        5 |       63 |       14 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   3                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
  9. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 10170 |  40.7526 | -73.9755 |       80  |   221941  |     12.5  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |     3139 |       28 |       20 |        2 |       63 |       14 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   2                             |
     +-----------------------------------------------------------------+

     +-----------------------------------------------------------------+
 10. |   zip | latitude | longit~e | popula~y  | employ~y  | plant_~e  |
     | 60606 |  41.8868 | -87.6386 |     3488  |   209053  |       40  |
     |-----------------------------------------------------------------|
     | employ~t | team~are | cust~are | pres~are | team~ure | cust~ure |
     |   135296 |       29 |       19 |        3 |       63 |       23 |
     |-----------------------------------------------------------------|
     |                            pres~ure                             |
     |                                   4                             |
     +-----------------------------------------------------------------+

. generate zip_code = string(zip,"%05.0f")

. drop zip

. order zip_code

. export delimited "../data/derived/location-index.csv", replace
file ../data/derived/location-index.csv saved

. 
. *drop rural areas, CBP is not representative for these
. drop if population_density<10 | employment<50
(9,128 observations deleted)

. 
. generate ln_density = ln(population_density)

. foreach X of var *_share *_exposure {
  2.         lowess `X' ln_density, bw(0.5) generate(`X'_hat)
  3. }

. 
. do "fig4.do"

. graph drop _all

. 
. line teamwork_share_hat customer_share_hat presence_share_hat population_dens
> ity, sort ///
> caption("(A)", position(6)) ytitle("Share of workers (percent)") xtitle("Popu
> lation density (person/km2, log scale)") ///
> scheme(s2mono) graphregion(color(white)) xscale(log) xlabel(10 100 1000 10000
>  100000) ///
> legend(region(lstyle(none)) bplacement(5) order(1 "Teamwork" 2 "Customer cont
> act")) ///
> name(fig4a)

. 
. line teamwork_exposure_hat customer_exposure_hat presence_exposure_hat popula
> tion_density, sort ///
> caption("(B)", position(6)) ytitle("Social distancing exposure (max=100)") xt
> itle("Population density (person/km2, log scale)") ///
> scheme(s2mono) graphregion(color(white)) xscale(log) xlabel(10 100 1000 10000
>  100000) ///
> legend(region(lstyle(none)) bplacement(7) order(3 "Physical presence")) ///
> name(fig4b)

. 
. graph combine fig4a fig4b, iscale(1.1) scheme(s2mono) graphregion(color(white
> )) xsize(9)

. 
. graph export "../text/overleaf/fig4.eps", replace
(file ../text/overleaf/fig4.eps written in EPS format)

. graph export "../text/overleaf/fig4.pdf", replace
(file ../text/overleaf/fig4.pdf written in PDF format)

. 
end of do-file

. 
end of do-file
