
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do scatter-communication-infection.do 

. clear all

. use "../data/derived/occupation/risks.dta", clear

. 
. 
. cap drop label_occup2

. gen label_occup2=""
(764 missing values generated)

. replace label_occup2="Tire builders" if SOCCode=="51-9197"
variable label_occup2 was str1 now str13
(1 real change made)

. replace label_occup2="Cutters and trimmers" if SOCCode=="51-9031"
variable label_occup2 was str13 now str20
(1 real change made)

. replace label_occup2="PR managers" if  SOCCode=="11-2031"
(1 real change made)

. replace label_occup2="HR managers" if   SOCCode=="11-3121"
(1 real change made)

. replace label_occup2="Educational counselors" if   SOCCode=="21-1012"
variable label_occup2 was str20 now str22
(1 real change made)

. *replace label_occup2="Nurse midwives" if   SOCCode=="29-1161"
. replace label_occup2="Healthcare social workers"  if   SOCCode=="21-1022"
variable label_occup2 was str22 now str25
(1 real change made)

. replace label_occup2="Software developers"   if   SOCCode=="15-1132"
(1 real change made)

. *replace label_occup2="Petroleum engineers"   if   SOCCode=="17-2171"
. replace label_occup2="Chemical engineers" if  SOCCode=="17-2041"
(1 real change made)

. *replace label_occup2="Aerospace engineers" if  SOCCode=="17-2011"
. *replace label_occup2="Architects" if  SOCCode=="17-1011"
. replace label_occup2="Training and development specialists" if  SOCCode=="13-
> 1151"
variable label_occup2 was str25 now str36
(1 real change made)

. replace label_occup2="Statisticians" if  SOCCode=="15-2041"
(1 real change made)

. replace label_occup2="Mathematicians" if  SOCCode=="15-2021"
(1 real change made)

. replace label_occup2="Lawyers" if  SOCCode=="23-1011" 
(1 real change made)

. *replace label_occup2="Sewing machine operators" if SOCCode=="51-6031"
. replace label_occup2="Fine artists" if SOCCode=="27-1013"
(1 real change made)

. replace label_occup2="Shoe machine operators" if SOCCode=="51-6042"
(1 real change made)

. 
. 
. scatter customer teamwork, graphregion(color(white)) msymbol(circle_hollow) /
> //
> ytitle("Customer contact") xtitle("Coworker contact") mlabel(label_occup2) gr
> aphregion(margin(3 15 1 3))

. graph export "../text/overleaf/fig3.eps", replace
(file ../text/overleaf/fig3.eps written in EPS format)

. graph export "../text/overleaf/fig3.pdf", replace
(file ../text/overleaf/fig3.pdf written in PDF format)

. 
end of do-file
