
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do aggregate_risk_by_naics.do 

. clear all

. use "../../clean/employment-matrix/matrix.dta"

. 
. local indexes teamwork customer presence

. 
. merge m:1 SOCCode using "risks.dta", keep(master match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                           579
        from master                       579  
        from using                          0  

    matched                            12,245  
    -----------------------------------------

. * a few cases are missing the risk, take these to be low risk
. mvencode `indexes', mv(0) override
    teamwork: 582 missing values recoded
    customer: 582 missing values recoded
    presence: 582 missing values recoded

. 
. replace Employment = round(Employment*1000)
(12,824 real changes made)

. compress
  variable Employment was double now long
  (51,296 bytes saved)

. 
. foreach X of var `indexes' {
  2.         summarize `X' [fw=Employment], detail
  3.         generate double `X'_share = (`X' >= r(p75)) * Employment
  4. }

                          teamwork
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           34              0
10%           38              0       Obs         121,347,700
25%           45              0       Sum of Wgt. 121,347,700

50%           52                      Mean           52.87694
                        Largest       Std. Dev.      13.14225
75%           61             85
90%           71             85       Variance       172.7188
95%           74             85       Skewness      -.6164195
99%           78             85       Kurtosis       5.217017

            Customer communication index [0,100]
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           35              0
10%           38              0       Obs         121,347,700
25%           47              0       Sum of Wgt. 121,347,700

50%           55                      Mean           55.58012
                        Largest       Std. Dev.      14.21306
75%           66             86
90%           73             86       Variance       202.0111
95%           77             86       Skewness      -.7034038
99%           82             89       Kurtosis       4.684272

               Physical presence index [0,100]
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            5              0
10%            6              0       Obs         121,347,700
25%           13              0       Sum of Wgt. 121,347,700

50%           24                      Mean           23.09337
                        Largest       Std. Dev.      12.77028
75%           33             69
90%           41             69       Variance       163.0799
95%           44             69       Skewness       .2958237
99%           52             69       Kurtosis       2.377236

. 
. collapse (sum) Employment teamwork_share customer_share presence_share, by(in
> dustry_code)

. foreach X in `indexes' {
  2.         replace `X'_share = round(`X'_share / Employment * 100)
  3. }
(74 real changes made)
(74 real changes made)
(74 real changes made)

. drop Employment

. 
. export delimited "naics_risk.csv", replace
file naics_risk.csv saved

. 
end of do-file
