
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do aggregate_risk_by_naics.do 

. clear all

. use "../../clean/employment-matrix/matrix.dta"

. 
. merge m:1 SOCCode using "risks.dta", keep(master match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                           581
        from master                       581  
        from using                          0  

    matched                            12,343  
    -----------------------------------------

. * a few cases are missing the risk, take these to be low risk
. mvencode communication infection, mv(0) override
communicat~n: 581 missing values recoded
   infection: 581 missing values recoded

. 
. replace Employment = round(Employment*1000)
(12,924 real changes made)

. compress
  variable Employment was double now long
  (51,696 bytes saved)

. 
. foreach X of var communication infection {
  2.         summarize `X' [fw=Employment], detail
  3.         generate double high_`X' = (`X' > r(p75)) * Employment
  4. }

                 Communication index [0,100]
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           47              0
10%           51              0       Obs         121,347,700
25%           58              0       Sum of Wgt. 121,347,700

50%           66                      Mean           65.67987
                        Largest       Std. Dev.      13.46946
75%           74             96
90%           80             96       Variance       181.4263
95%           88             96       Skewness      -1.421078
99%           92             96       Kurtosis       9.172941

                Infection risk index [0,100]
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%           22              0
10%           24              0       Obs         121,347,700
25%           29              0       Sum of Wgt. 121,347,700

50%           41                      Mean           43.63649
                        Largest       Std. Dev.      19.15877
75%           52            100
90%           74            100       Variance       367.0584
95%           87            100       Skewness       .8936041
99%           92            100       Kurtosis       3.652464

. 
. collapse (sum) Employment high_communication high_infection, by(industry_code
> )

. foreach X in communication infection {
  2.         replace high_`X' = round(high_`X' / Employment * 100)
  3. }
(74 real changes made)
(75 real changes made)

. drop Employment

. 
. export delimited "naics_risk.csv", replace
file naics_risk.csv saved

. 
end of do-file
