
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.1   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 2-core Stata perpetual license:
       Serial number:  501506203290
         Licensed to:  Miklos Koren
                       CEU MicroData


Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do aggregate_risk_by_naics.do 

. clear all

. use "../../clean/employment-matrix/matrix.dta"

. 
. local indexes teamwork customer presence

. 
. merge m:1 SOCCode using "risks.dta", keep(master match) nogen

    Result                           # of obs.
    -----------------------------------------
    not matched                           579
        from master                       579  
        from using                          0  

    matched                            12,245  
    -----------------------------------------

. * a few cases are missing the risk, take these to be low risk
. mvencode `indexes', mv(0) override
    teamwork: 579 missing values recoded
    customer: 579 missing values recoded
    presence: 579 missing values recoded

. 
. replace Employment = round(Employment*1000)
(12,824 real changes made)

. compress
  variable Employment was double now long
  (51,296 bytes saved)

. 
. * both or all three
. generate byte communication = teamwork|customer

. generate byte affected = communication|presence

. 
. foreach X of var `indexes'  communication affected {
  2.         * index is high and context implies face2face
.         generate double `X'_share = `X' * Employment
  3. }

. collapse (sum) Employment teamwork_share customer_share presence_share commun
> ication_share affected_share, by(industry_code)

. foreach X in `indexes'  communication affected {
  2.         replace `X'_share = round(`X'_share / Employment * 100)
  3. }
(74 real changes made)
(74 real changes made)
(74 real changes made)
(74 real changes made)
(74 real changes made)

. drop Employment

. 
. export delimited "naics_risk.csv", replace
file naics_risk.csv saved

. 
end of do-file
